In [49]:
# Creating file 
import pandas as pd

df = pd.DataFrame([ ["Tom",       "Data Science",             1000],
                    ["Tom",       "IOT",                      2000],
                    ["Tom",       "Big Data",                 3000],
                    ["Hwa-pyung", "Artificial Intelligence",  11000],
                    ["Hwa-pyung", "Artificial Intelligence",  12000],
                    ["Yoshiro",   "Data Engineer",            6000],
                    ["Yoshiro",   "Data Engineer",            7000],
                    ["Yoshiro",   "Data Architect",           8000],
                    ["Yamraj",    "Data Architect",           13000],
                    ["Yamraj",    "Data Architect",           14000]],
                columns = (['Name','Departments','Salary']))

In [50]:
df

        Name              Departments  Salary
0        Tom             Data Science    1000
1        Tom                      IOT    2000
2        Tom                 Big Data    3000
3  Hwa-pyung  Artificial Intelligence   11000
4  Hwa-pyung  Artificial Intelligence   12000
5    Yoshiro            Data Engineer    6000
6    Yoshiro            Data Engineer    7000
7    Yoshiro           Data Architect    8000
8     Yamraj           Data Architect   13000
9     Yamraj           Data Architect   14000

In [51]:
df.to_csv("test5.csv", index = False)

In [52]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Aggregate").getOrCreate()

In [53]:
df_pyspark = spark.read.csv("test5.csv", header = True, inferSchema = True)

In [54]:
df_pyspark.show()

+---------+--------------------+------+
|     Name|         Departments|Salary|
+---------+--------------------+------+
|      Tom|        Data Science|  1000|
|      Tom|                 IOT|  2000|
|      Tom|            Big Data|  3000|
|Hwa-pyung|Artificial Intell...| 11000|
|Hwa-pyung|Artificial Intell...| 12000|
|  Yoshiro|       Data Engineer|  6000|
|  Yoshiro|       Data Engineer|  7000|
|  Yoshiro|      Data Architect|  8000|
|   Yamraj|      Data Architect| 13000|
|   Yamraj|      Data Architect| 14000|
+---------+--------------------+------+

In [60]:
df_pyspark.dtypes

[('Name', 'string'), ('Departments', 'string'), ('Salary', 'int')]

## GroupBy
we always need to add and aggregate function to groupby

In [81]:
# find total salaries by departments
df_pyspark.groupBy('Name').sum().sort("sum(Salary)").show()

# find mean salaries by departments

df_pyspark.groupBy('Name').mean().sort("avg(Salary)").show()

+---------+-----------+
|     Name|sum(Salary)|
+---------+-----------+
|      Tom|       6000|
|  Yoshiro|      21000|
|Hwa-pyung|      23000|
|   Yamraj|      27000|
+---------+-----------+

+---------+-----------+
|     Name|avg(Salary)|
+---------+-----------+
|      Tom|     2000.0|
|  Yoshiro|     7000.0|
|Hwa-pyung|    11500.0|
|   Yamraj|    13500.0|
+---------+-----------+

In [79]:
# count employees by departments
df_pyspark.groupBy('Name').count().show()

+---------+-----+
|     Name|count|
+---------+-----+
|Hwa-pyung|    2|
|      Tom|    3|
|   Yamraj|    2|
|  Yoshiro|    3|
+---------+-----+

In [63]:
# finding total expenditure by applying aggregate directly
df_pyspark.agg({'Salary':'sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|      77000|
+-----------+

In [96]:
# showing maximum salary per Name

# grouping column by name and summing up salaries
df2 = df_pyspark.groupBy('Name').sum()

#remaing columns
df2 = df2.withColumnRenamed("sum(Salary)", "sum_salary")

# showing result sorted in desc order
df2.sort(df2.sum_salary.desc()).show()

+---------+----------+
|     Name|sum_salary|
+---------+----------+
|   Yamraj|     27000|
|Hwa-pyung|     23000|
|  Yoshiro|     21000|
|      Tom|      6000|
+---------+----------+